# Chapter 7 - Data Cleaning and Preparation

## 7.1 Handling Missing Data

In [3]:
import pandas as pd
import numpy as np

In [4]:
string_data=pd.Series(['aardvark','artichoke',np.nan,'avocado'])

In [5]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
string_data[0]=None

In [7]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### Filtering Out Missing Data

In [8]:
from numpy import nan as NA

In [9]:
data=pd.Series([1,NA,3.5,NA,7])

In [10]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [11]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [12]:
data=pd.DataFrame([[1.,6.5,3.],[1.,NA,NA],[NA,NA,NA],[NA,6.5,3.]])

In [13]:
cleaned=data.dropna()

In [14]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [15]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [16]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [17]:
data[4]=NA

In [18]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [19]:
data.dropna(axis=1,how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [20]:
df=pd.DataFrame(np.random.rand(7,3))

In [21]:
df.iloc[:4,1]=NA

In [22]:
df.iloc[:2,2]=NA

In [23]:
df

          0         1         2
0  0.584949       NaN       NaN
1  0.696745       NaN       NaN
2  0.810969       NaN  0.037574
3  0.244170       NaN  0.266631
4  0.985376  0.182168  0.127396
5  0.026238  0.703240  0.189506
6  0.910041  0.173740  0.997796

In [24]:
df.dropna()

          0         1         2
4  0.985376  0.182168  0.127396
5  0.026238  0.703240  0.189506
6  0.910041  0.173740  0.997796

In [25]:
df.dropna(thresh=2)

          0         1         2
2  0.810969       NaN  0.037574
3  0.244170       NaN  0.266631
4  0.985376  0.182168  0.127396
5  0.026238  0.703240  0.189506
6  0.910041  0.173740  0.997796

### Filling In Missing Data

In [26]:
df.fillna(0)

          0         1         2
0  0.584949  0.000000  0.000000
1  0.696745  0.000000  0.000000
2  0.810969  0.000000  0.037574
3  0.244170  0.000000  0.266631
4  0.985376  0.182168  0.127396
5  0.026238  0.703240  0.189506
6  0.910041  0.173740  0.997796

In [27]:
df.fillna({1:0.5,2:0})

          0         1         2
0  0.584949  0.500000  0.000000
1  0.696745  0.500000  0.000000
2  0.810969  0.500000  0.037574
3  0.244170  0.500000  0.266631
4  0.985376  0.182168  0.127396
5  0.026238  0.703240  0.189506
6  0.910041  0.173740  0.997796

In [28]:
_=df.fillna(0,inplace=True)

In [29]:
df

          0         1         2
0  0.584949  0.000000  0.000000
1  0.696745  0.000000  0.000000
2  0.810969  0.000000  0.037574
3  0.244170  0.000000  0.266631
4  0.985376  0.182168  0.127396
5  0.026238  0.703240  0.189506
6  0.910041  0.173740  0.997796

In [30]:
df=pd.DataFrame(np.random.randn(6,3))

In [31]:
df.iloc[2:,1]=NA

In [32]:
df.iloc[4:,2]=NA

In [33]:
df

          0         1         2
0 -0.276535 -1.335937  0.593576
1  1.367146  0.643784 -1.258512
2  0.607976       NaN  0.053877
3 -0.957648       NaN -0.483442
4  1.463228       NaN       NaN
5  1.427886       NaN       NaN

In [34]:
df.fillna(method='ffill')

          0         1         2
0 -0.276535 -1.335937  0.593576
1  1.367146  0.643784 -1.258512
2  0.607976  0.643784  0.053877
3 -0.957648  0.643784 -0.483442
4  1.463228  0.643784 -0.483442
5  1.427886  0.643784 -0.483442

In [35]:
df.fillna(method='ffill',limit=2)

          0         1         2
0 -0.276535 -1.335937  0.593576
1  1.367146  0.643784 -1.258512
2  0.607976  0.643784  0.053877
3 -0.957648  0.643784 -0.483442
4  1.463228       NaN -0.483442
5  1.427886       NaN -0.483442

In [36]:
data=pd.Series([1.,NA,3.5,NA,7])

In [37]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## 7.2 Data Transformation

### Removing Duplicates

In [38]:
data=pd.DataFrame({'k1':['one','two']*3+['two'],
                    'k2':[1,1,2,3,3,4,4]})

In [39]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [40]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [41]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [42]:
data['v1']=range(7)

In [43]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [44]:
data.drop_duplicates(['k1','k2'],keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### Transforming Data using a Function or Mapping

In [45]:
data=pd.DataFrame({'food':['bacon','pulled pork','bacon','Pastrami','corned beef','Bacon','pastrami','honey ham','nova lox'], 'ounces':[4,3,12,6,7.5,8,3,5,6]})

In [46]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [47]:
meat_to_animal = {'bacon':'pig','pulled pork':'pig','pastrami':'cow','corned beef':'cow','honey ham':'pig','nova lox':'salmon'}

In [48]:
lowercased=data['food'].str.lower()

In [49]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [50]:
data['animal']=lowercased.map(meat_to_animal)

In [51]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [52]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### Replacing Values

In [53]:
data = pd.Series([1.,-999.,2.,-999.,-1000.,3.])

In [54]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [55]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [56]:
data.replace([-999,-1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [57]:
data.replace({-999:np.nan,-1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### Renaming Axis Indexes

In [58]:
data=pd.DataFrame(np.arange(12).reshape((3,4)), index=['Ohio','Colorado','New York'],columns=['one','two','three','four'])

In [59]:
transform = lambda x: x[:4].upper()

In [60]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [61]:
data.index = data.index.map(transform)

In [62]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [63]:
data.rename(index = str.title, columns = str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [64]:
data.rename(index = {'OHIO':'INDIANA'}, columns = {'three':'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [65]:
data.rename(index = {'OHIO':'INDIANA'}, inplace=True)

In [66]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

### Discretization and Binning

In [67]:
ages = [20,22,25,27,21,23,37,31,61,45,41,32]

In [68]:
bins = [18,25,35,60,100]

In [69]:
cats=pd.cut(ages,bins)

In [70]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

Categorical object

In [71]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [72]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [73]:
pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [74]:
pd.cut(ages,[18,26,36,61,100],right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [75]:
group_names=['Youth','YoungAdult','MiddleAged','Senior']

In [76]:
pd.cut(ages,bins,labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [77]:
data=np.random.rand(20)

In [78]:
pd.cut(data,4,precision=2) #precision is for number of decimal places

[(0.26, 0.48], (0.7, 0.92], (0.7, 0.92], (0.48, 0.7], (0.48, 0.7], ..., (0.042, 0.26], (0.042, 0.26], (0.042, 0.26], (0.26, 0.48], (0.48, 0.7]]
Length: 20
Categories (4, interval[float64]): [(0.042, 0.26] < (0.26, 0.48] < (0.48, 0.7] < (0.7, 0.92]]

In [79]:
data=np.random.randn(1000)

In [80]:
cats=pd.qcut(data,4)

In [81]:
cats

[(-0.634, -0.0186], (-3.1399999999999997, -0.634], (-0.0186, 0.698], (-0.634, -0.0186], (-0.0186, 0.698], ..., (0.698, 3.128], (-0.634, -0.0186], (-0.0186, 0.698], (-0.634, -0.0186], (0.698, 3.128]]
Length: 1000
Categories (4, interval[float64]): [(-3.1399999999999997, -0.634] < (-0.634, -0.0186] < (-0.0186, 0.698] < (0.698, 3.128]]

In [82]:
pd.value_counts(cats)

(-3.1399999999999997, -0.634]    250
(-0.634, -0.0186]                250
(-0.0186, 0.698]                 250
(0.698, 3.128]                   250
dtype: int64

In [83]:
pd.qcut(data,[0,0.1,0.5,0.9,1.])

[(-1.231, -0.0186], (-3.1399999999999997, -1.231], (-0.0186, 1.309], (-1.231, -0.0186], (-0.0186, 1.309], ..., (-0.0186, 1.309], (-1.231, -0.0186], (-0.0186, 1.309], (-1.231, -0.0186], (-0.0186, 1.309]]
Length: 1000
Categories (4, interval[float64]): [(-3.1399999999999997, -1.231] < (-1.231, -0.0186] < (-0.0186, 1.309] < (1.309, 3.128]]

### Detecting and Filtering Outliers

In [84]:
data=pd.DataFrame(np.random.randn(1000,4))

In [85]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.043906     0.039271    -0.007133    -0.004884
std       1.008023     0.982546     1.017478     1.003916
min      -3.479220    -2.800849    -3.650186    -3.372642
25%      -0.630190    -0.637586    -0.730594    -0.663232
50%       0.021645     0.040662    -0.055416    -0.018512
75%       0.726520     0.720845     0.675783     0.672561
max       3.042756     3.314141     3.345361     3.059034

In [86]:
col=data[2]

In [87]:
col[np.abs(col)>3]

68     3.149910
536   -3.650186
812    3.345361
Name: 2, dtype: float64

In [88]:
data[(np.abs(data)>3).any(1)]

            0         1         2         3
38   1.093396  0.972526 -0.090504  3.033543
61   3.028614  1.421808 -0.175812  0.398906
68  -0.320403 -1.400804  3.149910 -0.922582
360 -0.742474  3.314141  0.879597  0.322030
446 -0.155020  3.054685  1.303454  0.432882
473 -1.173502  0.569881 -0.157206  3.008802
484 -3.479220  1.262448 -1.402870 -0.602309
536  0.602640  0.160597 -3.650186 -0.761406
596  0.068227  3.248375 -1.909184 -0.890206
722  1.215739  1.147775  1.229650 -3.100391
807  3.042756  0.226691  1.652337 -0.062495
812  1.182162  0.714106  3.345361 -0.929506
877  0.164631  0.502471 -0.181848  3.059034
884 -1.217103 -0.399355 -0.835827 -3.372642

In [89]:
data[np.abs(data)>3] = np.sign(data)*3

In [90]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.044314     0.038654    -0.006978    -0.004512
std       1.006248     0.980599     1.013814     1.002121
min      -3.000000    -2.800849    -3.000000    -3.000000
25%      -0.630190    -0.637586    -0.730594    -0.663232
50%       0.021645     0.040662    -0.055416    -0.018512
75%       0.726520     0.720845     0.675783     0.672561
max       3.000000     3.000000     3.000000     3.000000

In [91]:
np.sign(data).head()

     0    1    2    3
0  1.0  1.0 -1.0 -1.0
1  1.0 -1.0  1.0  1.0
2 -1.0 -1.0 -1.0  1.0
3 -1.0 -1.0 -1.0 -1.0
4 -1.0  1.0  1.0  1.0

### Permutation and Random Sampling

In [92]:
df=pd.DataFrame(np.arange(5*4).reshape((5,4)))

In [93]:
sampler=np.random.permutation(5)

In [94]:
sampler

array([3, 0, 2, 4, 1])

In [95]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [96]:
df.take(sampler)

    0   1   2   3
3  12  13  14  15
0   0   1   2   3
2   8   9  10  11
4  16  17  18  19
1   4   5   6   7

In [97]:
df.sample(n=3)

    0   1   2   3
2   8   9  10  11
4  16  17  18  19
0   0   1   2   3

In [98]:
choices=pd.Series([5,7,-1,6,4])

In [99]:
draws=choices.sample(n=10, replace=True)

In [100]:
draws

1    7
1    7
1    7
1    7
3    6
3    6
3    6
2   -1
1    7
2   -1
dtype: int64

### Computing Indicator/Dummy Variables

In [101]:
df=pd.DataFrame({'key':['b','b','a','c','a','b'],'data1':range(6)})

In [102]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [103]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [104]:
dummies=pd.get_dummies(df['key'],prefix='key')

In [105]:
df_with_dummy=df[['data1']].join(dummies)

In [106]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [107]:
mnames=['movie_id','title','genres']

In [108]:
movies=pd.read_table('datasets/movielens/movies.dat',sep='::',header=None,names=mnames)

<ipython-input-108-7a7cadb46cd0>:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  movies=pd.read_table('datasets/movielens/movies.dat',sep='::',header=None,names=mnames)

In [109]:
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [110]:
all_genres=[]

In [111]:
for x in movies.genres:
    all_genres.extend(x.split('|'))

In [112]:
genres=pd.unique(all_genres)

In [113]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [114]:
zero_matrix=np.zeros((len(movies),len(genres)))

In [115]:
dummies=pd.DataFrame(zero_matrix,columns=genres)

In [116]:
gen=movies.genres[0]

In [117]:
gen.split('|')

['Animation', "Children's", 'Comedy']

In [118]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2])

In [119]:
for i,gen in enumerate(movies.genres):
    indices=dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i,indices]=1

In [120]:
movies_windic=movies.join(dummies.add_prefix('Genre_'))

In [121]:
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                              1.0
Genre_Children's                             1.0
Genre_Comedy                                 1.0
Genre_Adventure                              0.0
Genre_Fantasy                                0.0
Genre_Romance                                0.0
Genre_Drama                                  0.0
Genre_Action                                 0.0
Genre_Crime                                  0.0
Genre_Thriller                               0.0
Genre_Horror                                 0.0
Genre_Sci-Fi                                 0.0
Genre_Documentary                            0.0
Genre_War                                    0.0
Genre_Musical                                0.0
Genre_Mystery                                0.0
Genre_Film-Noir                              0.0
Genre_Western                                0.0
Name: 0, dtype: object

In [122]:
np.random.seed(12345)

In [123]:
values=np.random.rand(10)

In [124]:
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [125]:
bins=[0,0.2,0.4,0.6,0.8,1]

In [126]:
pd.get_dummies(pd.cut(values,bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

## 7.3 String Manipulation

## String Object Methods

In [127]:
val='a,b,  guido'

In [128]:
val.split(',')

['a', 'b', '  guido']

In [129]:
pieces=[x.strip() for x in val.split(',')]

In [130]:
pieces

['a', 'b', 'guido']

In [131]:
first, second, third=pieces

In [132]:
first + '::' + second + '::' + third

'a::b::guido'

In [133]:
'::'.join(pieces)

'a::b::guido'

In [134]:
'guido' in val

True

In [135]:
val.index(',')

1

In [136]:
val.find(':')

-1

In [137]:
val.count(',')

2

In [138]:
val.replace(',','::')

'a::b::  guido'

In [139]:
val.replace(',','')

'ab  guido'

### Regular Expressions

In [140]:
import re

In [141]:
text="foo   bar\t baz  \tqux"

In [142]:
re.split('\s+',text)

['foo', 'bar', 'baz', 'qux']

In [143]:
regex=re.compile('\s+')

In [144]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [145]:
regex.findall(text)

['   ', '\t ', '  \t']

In [146]:
text="""Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern=r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [147]:
regex=re.compile(pattern,flags=re.IGNORECASE)

In [148]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [149]:
m=regex.search(text)

In [150]:
m

In [151]:
text[m.start():m.end()]

'dave@google.com'

In [152]:
print(regex.match(text))

None

In [153]:
print(regex.sub('REDACTED',text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [154]:
pattern = r'([A-Z0-9._%=-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [155]:
regex=re.compile(pattern,flags=re.IGNORECASE)

In [156]:
m=regex.match('wesm@bright.net')

In [157]:
m.groups()

('wesm', 'bright', 'net')

In [158]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [159]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3',text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

### Vectorized String Functions in pandas

In [160]:
data={'Dave':'dave@google.com','Steve':'steve@gmail.com','Rob':'rob@gmail.com','Wes':np.nan}

In [161]:
data=pd.Series(data)

In [162]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [163]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [164]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [165]:
pattern

'([A-Z0-9._%=-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [166]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [167]:
matches=data.str.match(pattern, flags=re.IGNORECASE)

In [168]:
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [172]:
matches.str.get(1)

AttributeError: Can only use .str accessor with string values!

In [173]:
matches.str[0]

AttributeError: Can only use .str accessor with string values!

In [174]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object